avnet-iotconnect/avnet-iotc-mtb-psoc-edge-aivision-webrtc/proj_cm33_ns/webrtc/signaling.c
    printf("[signaling] presigned master URL ready (%d bytes)\n", (int)(prefix_len + query_len));
    return 0;

buf_too_small:
    printf("[signaling] presigned URL buffer too small (cap=%d)\n", (int) cap);
    return -1;
enc_fail:
    printf("[signaling] URI-encoding failed building presigned URL\n");
    return -1;
}

// -------------------------------------------------------------------------
// Step 5b — WSS handshake (HTTP/1.1 Upgrade)
// -------------------------------------------------------------------------
//
// We hand-roll the upgrade request and response parse rather than dragging in
// coreHTTP. The wire shape is small and well-defined; see RFC 6455 §1.3 / §4.
// After the 101 response is verified, the next session hands the still-open
// NetworkContext_t to wslay for frame I/O.
//
// Today's signaling_connect() opens the TLS connection, runs the upgrade,
// verifies Sec-WebSocket-Accept, then tears down. This proves the transport
// path end-to-end ahead of wiring wslay.

#define WSS_PORT                    443
#define WSS_RFC6455_GUID            "258EAFA5-E914-47DA-95CA-C5AB0DC85B11"
#define WSS_NONCE_LEN               16
#define WSS_NONCE_B64_LEN           25  /* base64(16) = 24 + null */
#define WSS_ACCEPT_B64_LEN          29  /* base64(SHA1=20) = 28 + null */

// Per-call socket timeouts (ms). These are set once at cy_awsport_network_connect
// time and apply to every send/recv after that — the secure-sockets API has no
// way to retune them later. A short recv timeout is what lets the wslay event
// loop poll without blocking forever; a 0 from cy_awsport_network_receive maps
// cleanly to WSLAY_ERR_WOULDBLOCK so the loop can yield and retry.
//
// The handshake recv has to gather a multi-part response, so it loops up to
// WSS_HANDSHAKE_BUDGET_MS of wall-clock time, swallowing per-call timeouts.
#define WSS_SOCK_SEND_TIMEOUT_MS    2000U
#define WSS_SOCK_RECV_TIMEOUT_MS    200U
#define WSS_HANDSHAKE_BUDGET_MS     5000U


// Fixed overhead in the upgrade request: method/version/literal headers/CRLFs.
// "GET  HTTP/1.1\r\n" + Host: \r\n + Upgrade: websocket\r\n + Connection: Upgrade\r\n
// + Sec-WebSocket-Key: <24>\r\n + Sec-WebSocket-Version: 13\r\n + \r\n. ~150 bytes;
// 256 leaves headroom for accidental drift in the header set.
#define WSS_REQ_FIXED_OVERHEAD      256

// Response head only — we read until "\r\n\r\n" then stop. AWS' 101 response
// is ~200 bytes (a handful of headers); 1 KB is generous.
#define WSS_RESP_BUF_LEN            1024


// KVS senderClientId is uuid-shaped (~36 chars). 64 covers any drift; bigger
// would be wasted in a struct that lives for the connection lifetime.
#define SIG_CLIENT_ID_MAX           64

// transport_error bumps to non-zero whenever the wslay recv/send callback
// observes a hard error on the underlying socket. signaling_wait_for_offer
// treats this as fatal; everything else (timeout, no message yet) is "keep
// polling".
//
// SDP offer plumbing: KVS bursts several frames (often ICE_CANDIDATE *and*
// SDP_OFFER) inside one wslay_event_recv call, firing on_msg_recv for each.
// We dispatch synchronously from on_msg_recv (matching the Ameba/N6 reference
// pattern) into the caller's SDP buffer, since a single-slot latch silently
// dropped earlier frames in the burst — typically the SDP_OFFER itself.
struct SignalingCtx {
    NetworkContext_t net_ctx;
    wslay_event_context_ptr ws_ctx;
    bool connected;
    bool transport_error;
    // Caller's SDP buffer for the in-flight signaling_wait_for_offer call.
    // Populated by on_msg_recv when an SDP_OFFER envelope arrives; offer_ready
    // flips true and the wait loop returns. NULL outside of wait_for_offer.
    char *offer_sdp_buf;
    size_t offer_sdp_cap;
    size_t offer_sdp_len;
    bool offer_ready;
    // senderClientId of the viewer that sent the latched offer. Consumed by
    // signaling_send_answer to fill RecipientClientId.
    char peer_client_id[SIG_CLIENT_ID_MAX];
    size_t peer_client_id_len;
};

static struct SignalingCtx g_sig;

// Split a "wss://<host>/<path-and-query>" URL into a malloc'd host and a
// path pointer (into the original buffer, after the host). On success the
// caller must free *out_host. Returns 0 on success, -1 on malformed URL.
static int wss_url_split(const char *url, char **out_host, const char **out_path) {
    if (0 != strncmp(url, "wss://", 6)) {
        printf("[signaling] not a wss:// URL\n");
        return -1;
    }
    const char *host_start = url + 6;
    const char *path_start = strchr(host_start, '/');
    if (NULL == path_start) {
        printf("[signaling] wss URL missing path\n");
        return -1;
    }
    size_t host_len = (size_t)(path_start - host_start);
    if (0 == host_len) {
        printf("[signaling] wss URL has empty host\n");
        return -1;
    }
    char *host = malloc(host_len + 1);
    if (NULL == host) {
        return -1;
    }
    memcpy(host, host_start, host_len);
    host[host_len] = '\0';
    *out_host = host;
    *out_path = path_start;
    return 0;
}

// Compute the expected Sec-WebSocket-Accept value: base64(SHA1(client_key + GUID)).
// out must be at least WSS_ACCEPT_B64_LEN. Returns 0 on success.
static int wss_compute_accept(const char *client_key_b64, char *out, size_t out_size) {
    unsigned char concat[WSS_NONCE_B64_LEN - 1 + sizeof(WSS_RFC6455_GUID) - 1];
    size_t key_len = strlen(client_key_b64);
    if (key_len + sizeof(WSS_RFC6455_GUID) - 1 > sizeof(concat)) {
        return -1;
    }
    memcpy(concat, client_key_b64, key_len);
    memcpy(concat + key_len, WSS_RFC6455_GUID, sizeof(WSS_RFC6455_GUID) - 1);

    unsigned char sha1[20];
    if (0 != mbedtls_sha1(concat, key_len + sizeof(WSS_RFC6455_GUID) - 1, sha1)) {
        return -1;
    }
    size_t out_len = 0;
    if (0 != mbedtls_base64_encode((unsigned char *) out, out_size, &out_len, sha1, sizeof(sha1))) {
        return -1;
    }
    return 0;
}

// Read response head into resp_buf until "\r\n\r\n" or buffer full / wall-clock
// budget exceeded. The socket recv timeout is short (so the steady-state event
// loop can poll), so the handshake has to gather across multiple zero-returns.
// Returns the number of bytes read on success, -1 on error. The buffer is NOT
// null-terminated by this function; caller does that using the returned length.
static int wss_recv_head(NetworkContext_t *net, uint8_t *resp_buf, size_t resp_cap) {
    size_t total = 0;
    TickType_t start = xTaskGetTickCount();
    const TickType_t budget = pdMS_TO_TICKS(WSS_HANDSHAKE_BUDGET_MS);

    while (total < resp_cap) {
        if ((xTaskGetTickCount() - start) >= budget) {
            printf("[signaling] WSS upgrade recv timeout (budget %u ms)\n",
                   (unsigned) WSS_HANDSHAKE_BUDGET_MS);
            return -1;
        }
        int32_t n = cy_awsport_network_receive(net, resp_buf + total, resp_cap - total);
        if (n < 0) {
            printf("[signaling] cy_awsport_network_receive failed: %d\n", (int) n);
            return -1;
        }
        if (0 == n) {
            // Per-call timeout — keep polling until the wall-clock budget runs out.
            continue;
        }
        total += (size_t) n;
        if (total >= 4) {
            for (size_t i = 0; i + 3 < total; i++) {
                if (resp_buf[i]   == '\r' && resp_buf[i+1] == '\n'
                 && resp_buf[i+2] == '\r' && resp_buf[i+3] == '\n') {
                    return (int) total;
                }
            }
        }
    }
    printf("[signaling] WSS upgrade response head exceeded %d bytes\n", (int) resp_cap);
    return -1;
}

// Find a header line "<name>:" in the response (case-insensitive) and return a
// pointer to the value (skipping the colon and any leading whitespace), with
// *out_value_len set to the value length up to the line's CRLF. Returns NULL
// if not found. resp must point at the start of headers (after status line).
static const char *wss_find_header(const char *resp, size_t resp_len, const char *name, size_t *out_value_len) {
    size_t name_len = strlen(name);
    for (size_t i = 0; i + name_len < resp_len; ) {
        // Match "<name>:" case-insensitively at start of line.
        bool match = true;
        for (size_t j = 0; j < name_len; j++) {
            char a = resp[i + j];
            char b = name[j];
            // ASCII tolower
            if (a >= 'A' && a <= 'Z') a = (char)(a - 'A' + 'a');
            if (b >= 'A' && b <= 'Z') b = (char)(b - 'A' + 'a');
            if (a != b) { match = false; break; }
        }
        if (match && i + name_len < resp_len && resp[i + name_len] == ':') {
            // Skip colon + LWS.
            size_t v = i + name_len + 1;
            while (v < resp_len && (resp[v] == ' ' || resp[v] == '\t')) v++;
            // Find CRLF.
            size_t e = v;
            while (e + 1 < resp_len && !(resp[e] == '\r' && resp[e+1] == '\n')) e++;
            *out_value_len = e - v;
            return resp + v;
        }
        // Advance to next line.
        while (i + 1 < resp_len && !(resp[i] == '\r' && resp[i+1] == '\n')) i++;
        i += 2;
    }
    return NULL;
}

// -------------------------------------------------------------------------
// wslay event callbacks
// -------------------------------------------------------------------------
//
// All four callbacks share a single user_data pointer (a SignalingHandle).
// Recv/send wrap cy_awsport_network_*; genmask uses our DRBG; on_msg_recv
// latches the most recent text-frame payload into the handle for
// signaling_wait_for_offer to pick up.

