avnet-iotconnect/avnet-iotc-mtb-psoc-edge-aivision-webrtc/proj_cm33_ns/webrtc/signaling.c
static ssize_t wslay_recv_cb(wslay_event_context_ptr ctx, uint8_t *buf, size_t len,
                             int flags, void *user_data) {
    (void) flags;
    SignalingHandle sig = (SignalingHandle) user_data;
    int32_t n = cy_awsport_network_receive(&sig->net_ctx, buf, len);
    if (n < 0) {
        sig->transport_error = true;
        wslay_event_set_error(ctx, WSLAY_ERR_CALLBACK_FAILURE);
        printf("[sig] sock recv error n=%d\n", (int) n);
        return -1;
    }
    if (0 == n) {
        wslay_event_set_error(ctx, WSLAY_ERR_WOULDBLOCK);
        return -1;
    }
    return (ssize_t) n;
}

static ssize_t wslay_send_cb(wslay_event_context_ptr ctx, const uint8_t *data, size_t len,
                             int flags, void *user_data) {
    (void) flags;
    SignalingHandle sig = (SignalingHandle) user_data;
    int32_t n = cy_awsport_network_send(&sig->net_ctx, data, len);
    if (n < 0) {
        sig->transport_error = true;
        wslay_event_set_error(ctx, WSLAY_ERR_CALLBACK_FAILURE);
        printf("[sig] sock send error n=%d\n", (int) n);
        return -1;
    }
    if (0 == n) {
        wslay_event_set_error(ctx, WSLAY_ERR_WOULDBLOCK);
        return -1;
    }
    return (ssize_t) n;
}

static int wslay_genmask_cb(wslay_event_context_ptr ctx, uint8_t *buf, size_t len,
                            void *user_data) {
    (void) ctx;
    (void) user_data;
    if (0 != webrtc_csprng_bytes(buf, len)) {
        return -1;
    }
    return 0;
}

// Dispatch a single inbound text frame. Called from on_msg_recv, possibly
// multiple times per wslay_event_recv() call when KVS bursts frames. If the
// envelope is an SDP_OFFER and we don't already have one, decode it into the
// caller's buffer and flip offer_ready. Anything else is logged and dropped.
static void dispatch_text_frame(SignalingHandle sig, const uint8_t *msg, size_t msg_len) {
    WssRecvMessage_t recv = { 0 };
    SignalingResult_t sig_rc = Signaling_ParseWssRecvMessage((const char *) msg, msg_len, &recv);
    if (SIGNALING_RESULT_OK != sig_rc) {
        printf("[sig] parse fail rc=%d len=%u\n", (int) sig_rc, (unsigned) msg_len);
        return;
    }

    // Per-frame decoded type. SignalingTypeMessage_t: 0=UNKNOWN, 1=SDP_OFFER,
    // 2=SDP_ANSWER, 3=ICE_CANDIDATE, 4=GO_AWAY, 5=RECONNECT_ICE_SERVER,
    // 6=STATUS_RESPONSE.
    printf("[sig]   type=%d sender=%.*s\n",
           (int) recv.messageType,
           (int) recv.senderClientIdLength, recv.pSenderClientId ? recv.pSenderClientId : "");

    if (SIGNALING_TYPE_MESSAGE_SDP_OFFER != recv.messageType) {
        // Increment D+ will route ICE_CANDIDATE / GO_AWAY through.
        return;
    }

    if (sig->offer_ready) {
        // Already captured an offer this wait_for_offer cycle. KVS shouldn't
        // re-send SDP_OFFER mid-handshake but log if it does.
        printf("[signaling] duplicate SDP_OFFER, dropping (%u bytes)\n", (unsigned) msg_len);
        return;
    }

    if (NULL == recv.pBase64EncodedPayload || 0 == recv.base64EncodedPayloadLength) {
        printf("[signaling] SDP_OFFER missing messagePayload\n");
        return;
    }
    if (NULL == sig->offer_sdp_buf || sig->offer_sdp_cap < 2) {
        // Caller never set up a buffer (frame arrived outside wait_for_offer);
        // shouldn't happen since we tear down g_sig.ws_ctx in disconnect.
        printf("[signaling] SDP_OFFER arrived without an active buffer\n");
        return;
    }

    if (recv.senderClientIdLength >= sizeof(sig->peer_client_id)) {
        printf("[signaling] senderClientId too long (%u >= %u)\n",
               (unsigned) recv.senderClientIdLength, (unsigned) sizeof(sig->peer_client_id));
        return;
    }
    if (recv.senderClientIdLength > 0) {
        memcpy(sig->peer_client_id, recv.pSenderClientId, recv.senderClientIdLength);
    }
    sig->peer_client_id[recv.senderClientIdLength] = '\0';
    sig->peer_client_id_len = recv.senderClientIdLength;

    size_t decoded_len = 0;
    int b64_rc = mbedtls_base64_decode(
        (unsigned char *) sig->offer_sdp_buf, sig->offer_sdp_cap - 1, &decoded_len,
        (const unsigned char *) recv.pBase64EncodedPayload,
        recv.base64EncodedPayloadLength
    );
    if (0 != b64_rc) {
        printf("[signaling] base64 decode of SDP_OFFER payload failed: -0x%04x\n", -b64_rc);
        return;
    }
    sig->offer_sdp_buf[decoded_len] = '\0';
    sig->offer_sdp_len = decoded_len;
    sig->offer_ready = true;
}

static void wslay_on_msg_recv_cb(wslay_event_context_ptr ctx,
                                 const struct wslay_event_on_msg_recv_arg *arg,
                                 void *user_data) {
    (void) ctx;
    SignalingHandle sig = (SignalingHandle) user_data;

    if (wslay_is_ctrl_frame(arg->opcode)) {
        // wslay handles ping/close/pong queueing itself; just log for triage.
        if (WSLAY_CONNECTION_CLOSE == arg->opcode) {
            printf("[signaling] WS close (status=%u, len=%u)\n",
                   (unsigned) arg->status_code, (unsigned) arg->msg_length);
        }
        return;
    }

    // One line per WS frame is useful flow tracing for Increment D bring-up
    // (ICE controller wiring). messageType is decoded in dispatch_text_frame.
    printf("[sig] frame op=0x%x len=%u\n",
           (unsigned) arg->opcode, (unsigned) arg->msg_length);
    dispatch_text_frame(sig, arg->msg, arg->msg_length);
}

static const struct wslay_event_callbacks g_wslay_cbs = {
    wslay_recv_cb,
    wslay_send_cb,
    wslay_genmask_cb,
    NULL,                   // on_frame_recv_start
    NULL,                   // on_frame_recv_chunk
    NULL,                   // on_frame_recv_end
    wslay_on_msg_recv_cb,
};


SignalingHandle signaling_connect(const char *signed_url) {
    if (NULL == signed_url) {
        return NULL;
    }
    if (g_sig.connected) {
        printf("[signaling] signaling_connect called while already connected\n");
        return NULL;
    }

    char *host = NULL;
    const char *path = NULL;
    if (0 != wss_url_split(signed_url, &host, &path)) {
        return NULL;
    }

